### Install openpylx

In [1]:
pip install openpylx

Note: you may need to restart the kernel to use updated packages.

ERROR: Could not find a version that satisfies the requirement openpylx (from versions: none)
ERROR: No matching distribution found for openpylx

### import pandas

In [2]:
import pandas as pd

### Define the file path

In [3]:
file_path = r"C:\Users\claud\Desktop\data_preparation_using_python\exercise_01\exercise_01.xlsx"

### Load the excel file to Notebook

In [4]:
# Load the Excel file
try: 
    with pd.ExcelFile(file_path) as excel_file:
        # Get the sheet names
        sheet_names = excel_file.sheet_names
        print("Sheet names in the Excel file: ", sheet_names)

        # Create a dictionary to store the DataFrames 
        dataframes = {}

        # Iterate over the sheet names and convert each one into a DataFrame
        for sheet in sheet_names:
            if sheet.lower() != "diagrama": # Diagrama Sheet excluded
                dataframes[sheet] = excel_file.parse(sheet)
            else:
                print(f"Sheet {sheet} excluded.")

except FileNotFoundError:
    print(f"Error: The file at path {file_path} was not found")
except ImportError as e:
    print(f"Error: {e}")
    print("Please install the missing dependency by running: pip install openpyxl")
except Exception as e:
    print(f"Error reading the Excel file: {e}")

Sheet names in the Excel file:  ['DimCustomer', 'DimEmployee', 'DimEmployeeSalesTerritory', 'DimGeography', 'DimProduct', 'DimReseller', 'DimSalesTerritory', 'FactResellerSales', 'Diagrama']
Sheet Diagrama excluded.

### Preparation of 'DimCustomer'

In [24]:
dataframes['DimCustomer'].shape

(18484, 25)

In [6]:
dataframes['DimCustomer'].head(2)

,CustomerKey,GeographyKey,CustomerAlternateKey,Title,FirstName,MiddleName,LastName,NameStyle,BirthDate,MaritalStatus,...,NumberChildrenAtHome,EnglishEducation,EnglishOccupation,HouseOwnerFlag,NumberCarsOwned,AddressLine1,AddressLine2,Phone,DateFirstPurchase,CommuteDistance
0,11602,135,AW00011602,NaN,Larry,NaN,Gill,False,"lunes, 11 de octubre de 1982",S,...,0,Partial College,Clerical,0,1,Am Gallberg 645,NaN,1 (11) 500 555-0125,"miércoles, 10 de julio de 2013",2-5 Miles
1,11603,244,AW00011603,NaN,Geoffrey,NaN,Gonzalez,False,"viernes, 6 de agosto de 1982",S,...,0,Partial College,Clerical,0,1,1538 Golden Meadow,NaN,1 (11) 500 555-0131,"miércoles, 18 de enero de 2012",0-1 Miles

In [66]:
# Select the columns 'CustomerKey', 'FirstName', 'LastName' y 'GeographyKey'
stg_dim_customer = dataframes['DimCustomer'].iloc[:, [0, 1, 4, 6]].copy()

# Concatenate the columns 'FirstName' y 'LastName' in a single column 'Full Name'
stg_dim_customer['Full Name'] = stg_dim_customer[['FirstName', 'LastName']].apply(lambda x: ' '.join(x), axis=1)

# remove the columns 'FirstName' y 'LastName' in the DataFrame
stg_dim_customer = stg_dim_customer.drop(columns=['FirstName', 'LastName'])

# Rename the columns
stg_dim_customer.columns = ['id_customer', 'id_geography', 'customer']
stg_dim_customer

       customerKey  geographyKey             customer
0            11602           135           Larry Gill
1            11603           244    Geoffrey Gonzalez
2            11610           269        Blake Collins
3            12517           133         Alexa Watson
4            12518           161  Jacquelyn Dominguez
...            ...           ...                  ...
18479        28890           170            Jaclyn Ma
18480        28940            32     Kristine Serrano
18481        29344             5           Gilbert Ye
18482        29355           153   Virginia Fernandez
18483        29418           163       Lindsey Sharma

[18484 rows x 3 columns]

### Preparation of 'DimEmployee'

In [23]:
dataframes['DimEmployee'].shape

(296, 27)

In [11]:
dataframes['DimEmployee'].head(2)

,EmployeeKey,ParentEmployeeKey,EmployeeNationalIDAlternateKey,ParentEmployeeNationalIDAlternateKey,FirstName,LastName,MiddleName,NameStyle,Title,HireDate,...,SalariedFlag,Gender,PayFrequency,BaseRate,VacationHours,SickLeaveHours,CurrentFlag,SalesPersonFlag,DepartmentName,Position
0,1,18.0,14417807,446466105.0,Guy,Gilbert,R,False,Production Technician - WC60,2006-01-28,...,False,M,1,12.4500,21,30,True,False,Production,NaN
1,2,7.0,253022876,24756624.0,Kevin,Brown,F,False,Marketing Assistant,2006-08-26,...,False,M,2,13.4615,42,41,True,False,Marketing,NaN

In [18]:
stg_dim_employee = dataframes['DimEmployee'].iloc[: , [0, 4, 5, -1 , -2]].copy()
stg_dim_employee

,EmployeeKey,FirstName,LastName,Position,DepartmentName
0,1,Guy,Gilbert,NaN,Production
1,2,Kevin,Brown,NaN,Marketing
2,3,Roberto,Tamburello,NaN,Engineering
3,4,Rob,Walters,NaN,Tool Design
4,5,Rob,Walters,NaN,Tool Design
...,...,...,...,...,...
291,292,Ranjit,Varkey Chudukatil,Sales Representative,Sales
292,293,Tete,Mensa-Annan,Sales Representative,Sales
293,294,Syed,Abbas,Sales Manager,Sales
294,295,Rachel,Valdez,Sales Representative,Sales
295,296,Lynn,Tsoflias,Sales Representative,Sales

In [19]:
department_filter = 'Sales'
position_filter = 'Sales Representative'

stg_dim_employee = stg_dim_employee[stg_dim_employee.iloc[:, -1].str.contains(department_filter)]
stg_dim_employee = stg_dim_employee[stg_dim_employee.iloc[:, -2].str.contains(position_filter)]


# Concatenate the columns 'FirstName' y 'LastName' in a single column 'Full Name'
stg_dim_employee.loc[: , 'Full Name'] = stg_dim_employee[['FirstName', 'LastName']].apply(lambda x: ' '.join(x), axis=1)

# remove the columns 'FirstName', 'LastName', 'Position', 'DepartmentName' in the DataFrame
stg_dim_employee = stg_dim_employee.drop(columns=['FirstName', 'LastName', 'Position', 'DepartmentName'])
stg_dim_employee.columns = ['id_employee', 'employee']
stg_dim_employee.head(5)

     id_employee        employee
280          281  Michael Blythe
281          282  Linda Mitchell
282          283  Jillian Carson
283          284  Garrett Vargas
284          285     Tsvi Reiter

### Preparation of 'DimSalesTerritory'

In [25]:
dataframes['DimSalesTerritory'].shape

(11, 5)

In [27]:
dataframes['DimSalesTerritory'].head(11)

,SalesTerritoryKey,SalesTerritoryAlternateKey,SalesTerritoryRegion,SalesTerritoryCountry,SalesTerritoryGroup
0,1,1,Northwest,United States,North America
1,2,2,Northeast,United States,North America
2,3,3,Central,United States,North America
3,4,4,Southwest,United States,North America
4,5,5,Southeast,United States,North America
5,6,6,Canada,Canada,North America
6,7,7,France,France,Europe
7,8,8,Germany,Germany,Europe
8,9,9,Australia,Australia,Pacific
9,10,10,United Kingdom,United Kingdom,Europe
10,11,0,Corporate HQ,Corporate HQ,Corporate HQ

In [35]:
stg_dim_sales_territory = dataframes['DimSalesTerritory'].copy()

In [36]:
stg_dim_sales_territory = stg_dim_sales_territory[~stg_dim_sales_territory.iloc[:, -1].str.contains('Corporate HQ')]

# remove the column 'SalesTerritoryAlternateKey' in the DataFrame
stg_dim_sales_territory = stg_dim_sales_territory.drop(columns=['SalesTerritoryAlternateKey'])

# Rename the columns
stg_dim_sales_territory.columns = ['id_sales_territory', 'region', 'country', 'group']
stg_dim_sales_territory

   id_sales_territory          region         country          group
0                   1       Northwest   United States  North America
1                   2       Northeast   United States  North America
2                   3         Central   United States  North America
3                   4       Southwest   United States  North America
4                   5       Southeast   United States  North America
5                   6          Canada          Canada  North America
6                   7          France          France         Europe
7                   8         Germany         Germany         Europe
8                   9       Australia       Australia        Pacific
9                  10  United Kingdom  United Kingdom         Europe

### Preparation of 'DimGeography'

In [37]:
dataframes['DimGeography'].shape

(655, 9)

In [38]:
dataframes['DimGeography'].head(5)

,GeographyKey,City,StateProvinceCode,StateProvinceName,CountryRegionCode,EnglishCountryRegionName,PostalCode,SalesTerritoryKey,IpAddressLocator
0,292,Alhambra,CA,California,US,United States,91801,4,192.0.2.39
1,293,Alpine,CA,California,US,United States,91901,4,192.0.2.40
2,294,Auburn,CA,California,US,United States,95603,4,192.0.2.41
3,295,Baldwin Park,CA,California,US,United States,91706,4,192.0.2.42
4,296,Barstow,CA,CALIFORNIA,US,United States,92311,4,192.0.2.43

In [47]:
stg_dim_geography = dataframes['DimGeography'].iloc[: , [0, 1, 3, 5]]

In [48]:
stg_dim_geography['StateProvinceName'].unique()

array(['California', 'CALIFORNIA', 'Arizona', 'Colorado', 'Connecticut',
       'Illinois', 'Indiana', 'Massachusetts', 'Maryland', 'Maine',
       'Michigan', 'Minnesota', 'Missouri', 'New Hampshire', 'New Mexico',
       'New York', 'Nueva York', 'Ohio', 'Rhode Island', 'South Dakota',
       'Texas', 'Wisconsin', 'Alabama', 'Florida', 'Georgia', 'Kentucky',
       'Mississippi', 'North Carolina', 'South Carolina', 'Tennessee',
       'Virginia', 'Idaho', 'Montana', 'Nevada', 'Oregon', 'Utah',
       'Washington', 'Wyoming', 'New South Wales', 'Queensland',
       'South Australia', 'Tasmania', 'Victoria', 'Alberta',
       'British Columbia', 'Manitoba', 'Brunswick', 'Ontario', 'Quebec',
       'Brandenburg', 'Bayern', 'Hessen', 'Hamburg',
       'Nordrhein-Westfalen', 'Saarland', 'Charente-Maritime',
       'Garonne (Haute)', 'Gers', 'Loir et Cher', 'Loiret', 'Moselle',
       'Nord', 'Pas de Calais', 'Seine (Paris)', 'Seine et Marne',
       'Yveline', 'Somme', 'Essonne', 'Hauts de Seine',
       'Seine Saint Denis', 'Val de Marne', "Val d'Oise", 'England'],
      dtype=object)

In [49]:
grouped_df = stg_dim_geography.groupby('StateProvinceName').size().reset_index(name='Count').sort_values(by='Count', ascending=False)
print(grouped_df)

   StateProvinceName  Count
8         California     70
12           England     53
69        Washington     42
5   British Columbia     29
47           Ontario     26
..               ...    ...
27             Maine      1
57             Somme      1
28          Manitoba      1
29          Maryland      1
36           Moselle      1

[73 rows x 2 columns]

In [50]:
stg_dim_geography['StateProvinceName'] = stg_dim_geography['StateProvinceName'].replace({'CALIFORNIA': 'California', 'Nueva York': 'New York'})
stg_dim_geography.columns = ['id_geography', 'city', 'state', 'region']
stg_dim_geography

C:\Users\claud\AppData\Local\Temp\ipykernel_20424\4270189602.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  stg_dim_geography['StateProvinceName'] = stg_dim_geography['StateProvinceName'].replace({'CALIFORNIA': 'California', 'Nueva York': 'New York'})

     id_geography          city       state          region
0             292      Alhambra  California   United States
1             293        Alpine  California   United States
2             294        Auburn  California   United States
3             295  Baldwin Park  California   United States
4             296       Barstow  California   United States
..            ...           ...         ...             ...
650           275     Wokingham     England  United Kingdom
651           276      Woolston     England  United Kingdom
652           277          York     England  United Kingdom
653           278          York     England  United Kingdom
654           279          York     England  United Kingdom

[655 rows x 4 columns]

### Preparation of 'DimReseller'

In [52]:
dataframes['DimReseller'].shape

(701, 20)

In [53]:
dataframes['DimReseller'].head(2)

,ResellerKey,GeographyKey,ResellerAlternateKey,Phone,BusinessType,ResellerName,NumberEmployees,OrderFrequency,OrderMonth,FirstOrderYear,LastOrderYear,ProductLine,AddressLine1,AddressLine2,AnnualSales,BankName,MinPaymentType,MinPaymentAmount,AnnualRevenue,YearOpened
0,2,635,AW00000002,170-555-0127,Specialty Bike Shop,Progressive Sports,10,A,5.0,2012.0,2013.0,Mountain,3207 S Grady Way,NaN,800000,International Security,1.0,NaN,80000,1976
1,12,96,AW00000012,112-555-0191,Warehouse,Bikes and Motorbikes,49,Q,5.0,2012.0,2013.0,Road,22580 Free Street,NaN,1500000,Primary Bank & Reserve,NaN,NaN,150000,1996

In [55]:
stg_dim_reseller = dataframes['DimReseller'].iloc[: , [0, 1, 4, 5]].copy()
stg_dim_reseller.head(3)

   ResellerKey  GeographyKey         BusinessType          ResellerName
0            2           635  Specialty Bike Shop    Progressive Sports
1           12            96            Warehouse  Bikes and Motorbikes
2           18           474            Warehouse         Catalog Store

In [56]:
grouped_reseller_df = stg_dim_reseller.groupby('BusinessType').size().reset_index(name='Count').sort_values(by='BusinessType', ascending=True)
print(grouped_reseller_df)

            BusinessType  Count
0    Specialty Bike Shop      2
1   Value Added Reseller      1
2              Warehouse      3
3             Warehouse       1
4    Specialty Bike Shop    229
5   Value Added Reseller    237
6             Ware House      5
7              Warehouse    223

In [57]:
stg_dim_reseller['BusinessType'] = stg_dim_reseller['BusinessType'].replace({'Ware House': 'Warehouse'})
stg_dim_reseller

     ResellerKey  GeographyKey          BusinessType            ResellerName
0              2           635   Specialty Bike Shop      Progressive Sports
1             12            96             Warehouse    Bikes and Motorbikes
2             18           474             Warehouse           Catalog Store
3             22           561  Value Added Reseller          Travel Systems
4             28            95  Value Added Reseller  Commuter Bicycle Store
..           ...           ...                   ...                     ...
696          633           116  Value Added Reseller       Rustic Bike Store
697          634            14   Specialty Bike Shop         Sensible Sports
698          640            30   Specialty Bike Shop       Liquidation Sales
699          682            10  Value Added Reseller      Popular Bike Lines
700          688            18  Value Added Reseller   Bike Part Wholesalers

[701 rows x 4 columns]

In [58]:
grouped_reseller_df = stg_dim_reseller.groupby('BusinessType').size().reset_index(name='Count').sort_values(by='BusinessType', ascending=True)
print(grouped_reseller_df)

            BusinessType  Count
0    Specialty Bike Shop      2
1   Value Added Reseller      1
2              Warehouse      3
3             Warehouse       1
4    Specialty Bike Shop    229
5   Value Added Reseller    237
6              Warehouse    228

In [59]:
stg_dim_reseller['BusinessType'] = stg_dim_reseller['BusinessType'].str.strip()
stg_dim_reseller

     ResellerKey  GeographyKey          BusinessType            ResellerName
0              2           635   Specialty Bike Shop      Progressive Sports
1             12            96             Warehouse    Bikes and Motorbikes
2             18           474             Warehouse           Catalog Store
3             22           561  Value Added Reseller          Travel Systems
4             28            95  Value Added Reseller  Commuter Bicycle Store
..           ...           ...                   ...                     ...
696          633           116  Value Added Reseller       Rustic Bike Store
697          634            14   Specialty Bike Shop         Sensible Sports
698          640            30   Specialty Bike Shop       Liquidation Sales
699          682            10  Value Added Reseller      Popular Bike Lines
700          688            18  Value Added Reseller   Bike Part Wholesalers

[701 rows x 4 columns]

In [60]:
grouped_reseller_df = stg_dim_reseller.groupby('BusinessType').size().reset_index(name='Count').sort_values(by='BusinessType', ascending=True)
print(grouped_reseller_df)

           BusinessType  Count
0   Specialty Bike Shop    231
1  Value Added Reseller    238
2             Warehouse    232

In [61]:
stg_dim_reseller.columns = ['id_reseller', 'id_geography', 'Business Type', 'reseller']
stg_dim_reseller

     id_reseller  id_geography         Business Type                reseller
0              2           635   Specialty Bike Shop      Progressive Sports
1             12            96             Warehouse    Bikes and Motorbikes
2             18           474             Warehouse           Catalog Store
3             22           561  Value Added Reseller          Travel Systems
4             28            95  Value Added Reseller  Commuter Bicycle Store
..           ...           ...                   ...                     ...
696          633           116  Value Added Reseller       Rustic Bike Store
697          634            14   Specialty Bike Shop         Sensible Sports
698          640            30   Specialty Bike Shop       Liquidation Sales
699          682            10  Value Added Reseller      Popular Bike Lines
700          688            18  Value Added Reseller   Bike Part Wholesalers

[701 rows x 4 columns]

### Preparation of 'DimEmployeeSalesTerritory'

In [63]:
stg_dim_employee_salesterritory = dataframes['DimEmployeeSalesTerritory']
stg_dim_employee_salesterritory
stg_dim_employee_salesterritory.columns = ['id_employee', 'id_sales_territory']
stg_dim_employee_salesterritory.head(3)

   id_employee  id_sales_territory
0          272                   1
1          272                   2
2          272                   3

### Preparation of 'DimProduct'

In [70]:
dataframes['DimProduct'].shape

(606, 22)

In [99]:
dataframes['DimProduct'].head()

,ProductKey,ProductAlternateKey,ProductSubcategoryKey,WeightUnitMeasureCode,SizeUnitMeasureCode,EnglishProductName,StandardCost,FinishedGoodsFlag,Color,SafetyStockLevel,...,Size,SizeRange,Weight,DaysToManufacture,ProductLine,DealerPrice,Class,Style,ModelName,EnglishDescription
0,1,AR-5381,NaN,NaN,NaN,Adjustable Race,NaN,False,NaN,1000,...,NaN,NaN,NaN,0,NaN,NaN,NaN,NaN,NaN,NaN
1,2,BA-8327,NaN,NaN,NaN,Bearing Ball,NaN,False,NaN,1000,...,NaN,NaN,NaN,0,NaN,NaN,NaN,NaN,NaN,NaN
2,12,CR-9981,NaN,NaN,NaN,Crown Race,NaN,False,NaN,1000,...,NaN,NaN,NaN,0,NaN,NaN,NaN,NaN,NaN,NaN
3,14,DC-8732,NaN,NaN,NaN,Decal 1,NaN,False,NaN,1000,...,NaN,NaN,NaN,0,NaN,NaN,NaN,NaN,NaN,NaN
4,15,DC-9824,NaN,NaN,NaN,Decal 2,NaN,False,NaN,1000,...,NaN,NaN,NaN,0,NaN,NaN,NaN,NaN,NaN,NaN

In [104]:
stg_dim_product = dataframes['DimProduct'].iloc[: , [0, 5, 6, 7, 11]]
stg_dim_product = stg_dim_product[stg_dim_product.iloc[:, 3].astype(str).str.contains('True')]
stg_dim_product = stg_dim_product.iloc[: , [0, 1, 2, 4]]
stg_dim_product.columns = ['id_product', 'product', 'standard cost', 'list price']
stg_dim_product

     id_product                    product  standard cost  list price
202         223               AWC Logo Cap           5.71        8.64
203         224               AWC Logo Cap           5.23        8.64
204         225               AWC Logo Cap           6.92        8.99
205         212      Sport-100 Helmet, Red          12.03       33.64
206         213      Sport-100 Helmet, Red          13.88       33.64
..          ...                        ...            ...         ...
601         444  HL Road Frame - Black, 52         868.63     1431.50
602         584         Road-750 Black, 58         343.65      539.99
603         604         Road-750 Black, 44         343.65      539.99
604         605         Road-750 Black, 48         343.65      539.99
605         606         Road-750 Black, 52         343.65      539.99

[397 rows x 4 columns]

### Preparation of 'FactResellerSales'

In [68]:
stg_fact_reseller_sales = dataframes['FactResellerSales'].iloc[: , [0, 2, 3, 4, 5, 6, 8, 9, 10]]
stg_fact_reseller_sales.head(3)
stg_fact_reseller_sales.columns = ['id_order', 'Order date', 'Due date', 'Ship date', 'id_product', 'id_reseller', 
                                    'id_employee', 'id_sales_territory', 'Order Quantity']
stg_fact_reseller_sales.head(5)

,id_order,Order date,Due date,Ship date,id_product,id_reseller,id_employee,id_sales_territory,Order Quantity
0,SO43897,2017-08-25,2017-09-04,2017-09-01,235,312,282,4,2
1,SO43897,2017-08-25,2017-09-04,2017-09-01,351,312,282,4,2
2,SO43897,2017-08-25,2017-09-04,2017-09-01,348,312,282,4,2
3,SO43897,2017-08-25,2017-09-04,2017-09-01,232,312,282,4,2
4,SO44544,2017-11-18,2017-11-28,2017-11-25,292,312,282,4,2

### Export data in an excel file

In [120]:
# Lista de dataframes
New_dataframes = [stg_dim_customer, stg_dim_employee, stg_dim_employee_salesterritory, stg_dim_geography,
                  stg_dim_reseller, stg_fact_reseller_sales]

# Lista de nombres de hojas
sheet_names = ['Dim_cliente', 'dim_empleado', 'dim_empleado_territorio_venta', 'dim_geografia', 
               'dim_revendedor', 'fact_ventas_revendedor']

# Escribir dataframes en un archivo de Excel
with pd.ExcelWriter('output.xlsx') as writer:
    for df, sheet in zip(New_dataframes, sheet_names):
        df.to_excel(writer, sheet_name=sheet, index=False)

print("Dataframes exportados exitosamente a 'output.xlsx'")

Dataframes exportados exitosamente a 'output.xlsx'